# Tim Gormly
## Module 5, Task 4
### 2/11/2023

In this notebook, we will use SQL to perform CRUD operations on a sample database.

<hr>

### Create a connection to the database:

In [92]:

import sqlite3

connection = sqlite3.connect(r'C:\Users\timgo\OneDrive\Desktop\School\Spring2023\IntroToPython-master\IntroToPython-master\examples\IntroToPython\examples\ch17\sql\books.db')

<hr>

### Updating Pandas display options

We will update pandas so that only 10 columns are displayed.

In [93]:
import pandas as pd

pd.options.display.max_columns = 10

<hr>

### Use pd read_sql to select data from tables

Let's take a look at the data stored in the three tables in the books database.

In [94]:
pd.read_sql('SELECT * FROM authors', connection)

   id      first    last
0   1       Paul  Deitel
1   2     Harvey  Deitel
2   3      Abbey  Deitel
3   4        Dan   Quirk
4   5  Alexander    Wald

In [95]:
pd.read_sql('SELECT * FROM titles', connection)

         isbn                             title  edition copyright
0  0135404673     Intro to Python for CS and DS        1      2020
1  0132151006     Internet & WWW How to Program        5      2012
2  0134743350               Java How to Program       11      2018
3  0133976890                  C How to Program        8      2016
4  0133406954  Visual Basic 2012 How to Program        6      2014
5  0134601548          Visual C# How to Program        6      2017
6  0136151574         Visual C++ How to Program        2      2008
7  0134448235                C++ How to Program       10      2017
8  0134444302            Android How to Program        3      2017
9  0134289366         Android 6 for Programmers        3      2016

In [96]:
pd.read_sql('SELECT * FROM author_ISBN', connection)

    id        isbn
0    1  0134289366
1    2  0134289366
2    5  0134289366
3    1  0135404673
4    2  0135404673
5    1  0132151006
6    2  0132151006
7    3  0132151006
8    1  0134743350
9    2  0134743350
10   1  0133976890
11   2  0133976890
12   1  0133406954
13   2  0133406954
14   3  0133406954
15   1  0134601548
16   2  0134601548
17   1  0136151574
18   2  0136151574
19   4  0136151574
20   1  0134448235
21   2  0134448235
22   1  0134444302
23   2  0134444302

<hr>

## 1. SELECT

In the previous examples, we used * to request all data within the table.  Instead, we can specify which specific columns we would like to receive results for in the SELECT clause.  In this example, we will select only the first and last names from the authors table.

In [97]:
pd.read_sql('SELECT first, last FROM authors', connection)

       first    last
0       Paul  Deitel
1     Harvey  Deitel
2      Abbey  Deitel
3        Dan   Quirk
4  Alexander    Wald

<hr>

## 2. WHERE

The WHERE clause allows us to add criteria to our selection.  Perhaps we want to see only books copywritten after 2016.

In [98]:
pd.read_sql(""" SELECT title, edition, copyright 
                FROM titles 
                WHERE copyright > '2016'""", connection)

                           title  edition copyright
0  Intro to Python for CS and DS        1      2020
1            Java How to Program       11      2018
2       Visual C# How to Program        6      2017
3             C++ How to Program       10      2017
4         Android How to Program        3      2017

With the WHERE clause, we only received 5 results.  Without it, we would have pulled all 10 rows in the titles table.

We can use SQL wildcards in the WHERE clause to find results that match specific patterns.  For example, we can use the % wildcard to represent zero or more characters in the position of the %.  All author's with a last name starting with D can be found in this way:

In [99]:
pd.read_sql(""" SELECT id, first, last 
                FROM authors 
                WHERE last LIKE 'D%'""", connection)

   id   first    last
0   1    Paul  Deitel
1   2  Harvey  Deitel
2   3   Abbey  Deitel

The _ wildcard can be used to represent exactly 1 character in a given space.  We could find authors who's first name begins with any character, has a second character of 'b', and has zero or more characters after that 'b' using the following query:

In [100]:
pd.read_sql(""" SELECT id, first, last 
                FROM authors 
                WHERE first LIKE '_b%'""", connection)

   id  first    last
0   3  Abbey  Deitel

<hr>

## 3. ORDER BY